app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Hello Friend"], ["user_id", 3], ["created_at", "2018-04-17 07:13:32.957850"], ["updated_at", "2018-04-17 07:13:32.957850"]]
---
    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        respond_to do |f|
            if(!@post.save)